public/shipping/test.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
   xmlns:ws="http://ws.rating.uss.transforce.ca" 
   xmlns:xsd="http://ws.rating.uss.transforce.ca/xsd" 
   xmlns:xsd1="http://dto.uss.transforce.ca/xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <ws:getRates>
         <ws:request>
            <xsd:password>uss</xsd:password>
            <xsd:user_id>admin@uss.com</xsd:user_id>
            <xsd:shipment>
               <xsd1:delivery_address_line_1>170 Zenway Blvd. Unit 2</xsd1:delivery_address_line_1>
               <xsd1:delivery_city>Woodbridge</xsd1:delivery_city>
               <xsd1:delivery_country>CA</xsd1:delivery_country>
               <xsd1:delivery_name>Golden Leaf Automotive.</xsd1:delivery_name>
               <xsd1:delivery_postal_code>L4H2Y7</xsd1:delivery_postal_code>
               <xsd1:delivery_province>ON</xsd1:delivery_province>
               <xsd1:dimension_unit>I</xsd1:dimension_unit>
               <xsd1:packages>
                  <xsd1:package_info_num>
                     <xsd1:name>LENGTH</xsd1:name>
                     <xsd1:value>25</xsd1:value>
                  </xsd1:package_info_num>
                  <xsd1:package_info_num>
                     <xsd1:name>WIDTH</xsd1:name>
                     <xsd1:value>12</xsd1:value>
                  </xsd1:package_info_num>
                  <xsd1:package_info_num>
                     <xsd1:name>HEIGHT</xsd1:name>
                     <xsd1:value>9</xsd1:value>
                  </xsd1:package_info_num>
                  <xsd1:reported_weight>22</xsd1:reported_weight>
               </xsd1:packages>
               <xsd1:pickup_address_line_1>200</xsd1:pickup_address_line_1>
               <xsd1:pickup_city>BRAMPTON</xsd1:pickup_city>
               <xsd1:pickup_name>Loomis Loomis</xsd1:pickup_name>
               <xsd1:pickup_postal_code>L6T5S6</xsd1:pickup_postal_code>
               <xsd1:pickup_province>ON</xsd1:pickup_province>
               <xsd1:reported_weight_unit>L</xsd1:reported_weight_unit>
               <xsd1:service_type>DD</xsd1:service_type>
               <xsd1:shipper_num>HB4499</xsd1:shipper_num>
               <xsd1:shipper_date>2018-12-11</xsd1:shipper_date>
            </xsd:shipment>
         </ws:request>
      </ws:getRates>
   </soapenv:Body>
</soapenv:Envelope>
